---
kind: property
id: P:Autodesk.Revit.UI.Events.CommandEventArgs.CommandId
source: html/b1c1d16a-6515-25e5-c639-7294b28c5224.htm
---
# Autodesk.Revit.UI.Events.CommandEventArgs.CommandId Property

The command id.

## Syntax (C#)
```csharp
public RevitCommandId CommandId { get; }
```